app/controllers/artists_controller.rb

  def show
      binding.pry
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]