app/controllers/songs_controller.rb

  def index
      binding.pry
       @artist = Artist.find_by(:id => params[:artist_id])
      if @artist
          @songs = @artist.songs
      elsif !params.include?(:artist_id)
          @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
      binding.pry
      @artist = Artist.find_by(:id => params[:artist_id])
      @song = Song.find_by(:id => params[:id])
      binding.pry
      if @artist.songs.include?(@song)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 7]]